---
kind: type
id: T:Autodesk.Revit.DB.FamilyParameterSetIterator
source: html/c09f03e2-abff-5574-b1b0-1f1c6bad6c46.htm
---
# Autodesk.Revit.DB.FamilyParameterSetIterator

An iterator to a FamilyParameter set.

## Syntax (C#)
```csharp
public abstract class FamilyParameterSetIterator : APIObject,
	IEnumerator
```